Repository: Filipsss13524/Biomarkers-detector-application
Catalog: lib/l10n/app_*.arb
Languages: pl

# languageLabel
source: Language: English
pl: Jezyk: Polski

# title
source: Detection of vocal biomarkers
pl: Wykrywanie biomarkerów głosowych

# startHomeScreen
source: Let's start
pl: Rozpocznij

# personData
source: Provide patient details
pl: Podaj dane pacjenta

source: Name
pl: Imię

# here
source: Write here
pl: Wpisz tutaj

# requiredField
source: This field is required
pl: To pole jest wymagane

source: Surname
pl: Nazwisko

source: Date of birth
pl: Data urodzenia

source: Select date
pl: Wybierz datę

source: Select gender
pl: Wybierz płeć

# man
source: Male
pl: Mężczyzna

# woman
source: Female
pl: Kobieta

# makeRecord
source: Make a record
pl: Wykonaj nagranie

source: Task:
pl: Zadanie:

# taskDescription
source: Please pronounce the vowel 'a' for as long as possible.
pl: Proszę wymówić samogłoskę 'a' tak długo, jak to tylko możliwe.

# makeTest
source: Approve and test
pl: Zatwierdź i przebadaj

# waitText
source: The recording is being analyzed, wait!
pl: Trwa analiza nagrania, czekaj!

source: Test result
pl: Wynik badania

# birth
source: b.
pl: ur.

source: Spectrogram mel
pl: Spektogram mel

source: Back to menu
pl: Wróć do menu

# info
source: Play Recording: To review what has been recorded, click the 'Play' button and listen to the recording. New Recording: If a mistake occurred during the recording and you want to record a new voice sample, click the 'Start' button again to begin a new recording.
pl: Odwtórz nagranie: Aby sprawdzić, co zostało nagrane, kliknij przycisk 'Play' i odsłuchaj nagranie. Nowe nagranie: Jeśli podczas nagrywania wkradł się błąd i chcesz nagrać próbkę głosu od nowa, kliknij ponownie przycisk 'Start' i rozpocznij nowe nagranie.

# helpText
source: Server not responding: wait or try the analysis again!
pl: Server nie odpowiada: poczekaj lub spróbuj wykonać ponownie analize!

source: Error:
pl: Błąd:

source: Back
pl: Wróć

# dataerrortext
source: No data No data was sent for analysis, go back and record again
pl: Brak danych Żadne dane nie zostały wysłane do analizy wróć i wykonaj nagranie jeszcze raz

# timeerrortext
source: Timeout The server is not responding, please go back and resend the recording for analysis
pl: Przekroczenie czasu oczekiwania Serwer nie odpowiada wróć i wyślij nagranie do analizy ponownie

# serverIp
source: Server IP Address
pl: Adres IP serwera

# serverhelp
source: Please enter an IP address
pl: Proszę wprowadzić adres IP

source: Save
pl: Zapisz

# savecomfirmed
source: Save correctly
pl: Zapisano pomyślnie

# servervalid
source: Enter a valid IP address
pl: Wprowadź prawidłowy adres IP

# addressngrok
source: Ngrok Address
pl: Adres ngrok

# addressngrokhelp
source: Please enter an ngrok address
pl: Proszę wprowadzić adres ngrok

# addressngrokvalid
source: Enter a valid ngrok address
pl: Wprowadź prawidłowy adres ngrok

# addressIPngrok
source: Ngrok Server IP Address
pl: Adres IP serwera ngrok

# addressIPngrokhelp
source: Please enter an ngrok IP address
pl: Proszę wprowadzić adres IP serwera ngrok

# addressIPngrokvalid
source: Enter a valid ngrok IP address
pl: Wprowadź prawidłowy adres IP serwera ngrok

source: Server type:
pl: Typ serwera:

# global
source: Global (ngrok)
pl: Globalny (ngrok)

# local
source: Local (localhost)
pl: Lokalny (localhost)

# changest
source: Change server type
pl: Zmień typ serwera

# porthelp
source: Please enter port address
pl: Proszę wprowadzić adres portu

# portvalid
source: Enter a valid port address
pl: Wpisz prawidłowy adres portu

source: Domain
pl: Domena

# domainhint
source: Domain text
pl: Tekst domeny

source: Global (domain)
pl: Globalny (domena)
